"""
Цей модуль містить словник з аналітичними ймовірностями для всіх можливих сум 
при киданні двох шестигранних кубиків. Ймовірності базуються на кількості комбінацій, 
що призводять до кожної суми, поділеній на загальну кількість можливих результатів (36).
"""

# Словник аналітичних ймовірностей для сум двох шестигранних кубиків
analytical_probabilities: dict[int, float] = {
    2: 1/36,
    3: 2/36,
    4: 3/36,
    5: 4/36,
    6: 5/36,
    7: 6/36,
    8: 5/36,
    9: 4/36,
    10: 3/36,
    11: 2/36,
    12: 1/36,
}
