"""
Клас для створення вузлів (елементів) однозв'язного списку.
Кожен вузол зберігає дані та посилання на наступний вузол.
"""

class Node:
    """
    Представляє вузол однозв'язного списку, що містить значення і посилання на наступний елемент списку.
    """
    def __init__(self, data: int) -> None:
        """
        Ініціалізує вузол зі значенням даних та вказівником на наступний елемент списку.
        
        Параметри:
        data (int): значення, що зберігається у вузлі.
        """
        self.data: int = data  # Зберігає значення вузла
        self.next: 'Node' | None = None  # Вказівник на наступний вузол списку
